report.example/oltp_point_select_16threads.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 16
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 16 tps: 259191.99 qps: 259191.99 (r/w/o: 259191.99/0.00/0.00) lat (ms,95%): 0.09 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 16 tps: 258882.32 qps: 258882.32 (r/w/o: 258882.32/0.00/0.00) lat (ms,95%): 0.09 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 16 tps: 258843.62 qps: 258843.62 (r/w/o: 258843.62/0.00/0.00) lat (ms,95%): 0.09 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 16 tps: 255927.19 qps: 255927.19 (r/w/o: 255927.19/0.00/0.00) lat (ms,95%): 0.09 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 16 tps: 254679.35 qps: 254679.35 (r/w/o: 254679.35/0.00/0.00) lat (ms,95%): 0.09 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 16 tps: 255811.28 qps: 255811.28 (r/w/o: 255811.28/0.00/0.00) lat (ms,95%): 0.09 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 16 tps: 268847.49 qps: 268847.49 (r/w/o: 268847.49/0.00/0.00) lat (ms,95%): 0.09 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 16 tps: 267309.40 qps: 267309.40 (r/w/o: 267309.40/0.00/0.00) lat (ms,95%): 0.09 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 16 tps: 264642.70 qps: 264642.70 (r/w/o: 264642.70/0.00/0.00) lat (ms,95%): 0.09 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 16 tps: 258249.25 qps: 258249.25 (r/w/o: 258249.25/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 16 tps: 260242.56 qps: 260242.56 (r/w/o: 260242.56/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 16 tps: 267242.55 qps: 267242.55 (r/w/o: 267242.55/0.00/0.00) lat (ms,95%): 0.09 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 16 tps: 267831.93 qps: 267831.93 (r/w/o: 267831.93/0.00/0.00) lat (ms,95%): 0.09 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 16 tps: 269316.08 qps: 269316.08 (r/w/o: 269316.08/0.00/0.00) lat (ms,95%): 0.09 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 16 tps: 273061.11 qps: 273061.11 (r/w/o: 273061.11/0.00/0.00) lat (ms,95%): 0.09 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 16 tps: 278402.23 qps: 278403.23 (r/w/o: 278403.23/0.00/0.00) lat (ms,95%): 0.09 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 16 tps: 271146.59 qps: 271145.59 (r/w/o: 271145.59/0.00/0.00) lat (ms,95%): 0.09 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 16 tps: 264998.98 qps: 264998.98 (r/w/o: 264998.98/0.00/0.00) lat (ms,95%): 0.09 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 16 tps: 266120.09 qps: 266120.09 (r/w/o: 266120.09/0.00/0.00) lat (ms,95%): 0.09 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 266507.04 qps: 266507.04 (r/w/o: 266507.04/0.00/0.00) lat (ms,95%): 0.09 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 16 tps: 270735.24 qps: 270735.24 (r/w/o: 270735.24/0.00/0.00) lat (ms,95%): 0.08 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 16 tps: 275994.21 qps: 275994.21 (r/w/o: 275994.21/0.00/0.00) lat (ms,95%): 0.09 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 16 tps: 274950.94 qps: 274951.94 (r/w/o: 274951.94/0.00/0.00) lat (ms,95%): 0.09 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 16 tps: 276123.02 qps: 276122.02 (r/w/o: 276122.02/0.00/0.00) lat (ms,95%): 0.09 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 16 tps: 275760.20 qps: 275760.20 (r/w/o: 275760.20/0.00/0.00) lat (ms,95%): 0.09 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 16 tps: 277347.74 qps: 277347.74 (r/w/o: 277347.74/0.00/0.00) lat (ms,95%): 0.09 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 16 tps: 286632.09 qps: 286632.09 (r/w/o: 286632.09/0.00/0.00) lat (ms,95%): 0.08 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 16 tps: 284149.62 qps: 284149.62 (r/w/o: 284149.62/0.00/0.00) lat (ms,95%): 0.08 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 16 tps: 280674.85 qps: 280674.85 (r/w/o: 280674.85/0.00/0.00) lat (ms,95%): 0.08 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 283620.90 qps: 283620.90 (r/w/o: 283620.90/0.00/0.00) lat (ms,95%): 0.08 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            8073711
        write:                           0
        other:                           0
        total:                           8073711
    transactions:                        8073711 (269096.48 per sec.)
    queries:                             8073711 (269096.48 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.0020s
    total number of events:              8073711

Latency (ms):
         min:                                    0.03
         avg:                                    0.06
         max:                                    2.76
         95th percentile:                        0.09
         sum:                               478416.68

Threads fairness:
    events (avg/stddev):           504606.9375/59568.34
    execution time (avg/stddev):   29.9010/0.01