report.example/oltp_point_select_1threads.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 1 tps: 32850.72 qps: 32850.72 (r/w/o: 32850.72/0.00/0.00) lat (ms,95%): 0.03 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 1 tps: 32235.65 qps: 32235.65 (r/w/o: 32235.65/0.00/0.00) lat (ms,95%): 0.03 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 1 tps: 32907.03 qps: 32907.03 (r/w/o: 32907.03/0.00/0.00) lat (ms,95%): 0.03 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 1 tps: 32990.07 qps: 32990.07 (r/w/o: 32990.07/0.00/0.00) lat (ms,95%): 0.03 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 1 tps: 32382.88 qps: 32382.88 (r/w/o: 32382.88/0.00/0.00) lat (ms,95%): 0.04 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 1 tps: 32746.10 qps: 32746.10 (r/w/o: 32746.10/0.00/0.00) lat (ms,95%): 0.03 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 1 tps: 33293.00 qps: 33293.00 (r/w/o: 33293.00/0.00/0.00) lat (ms,95%): 0.03 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 1 tps: 33316.00 qps: 33316.00 (r/w/o: 33316.00/0.00/0.00) lat (ms,95%): 0.03 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 1 tps: 33596.04 qps: 33596.04 (r/w/o: 33596.04/0.00/0.00) lat (ms,95%): 0.04 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 1 tps: 33555.57 qps: 33555.57 (r/w/o: 33555.57/0.00/0.00) lat (ms,95%): 0.04 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 1 tps: 33582.97 qps: 33582.97 (r/w/o: 33582.97/0.00/0.00) lat (ms,95%): 0.04 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 1 tps: 33689.42 qps: 33689.42 (r/w/o: 33689.42/0.00/0.00) lat (ms,95%): 0.04 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 1 tps: 33716.01 qps: 33716.01 (r/w/o: 33716.01/0.00/0.00) lat (ms,95%): 0.04 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 1 tps: 33703.06 qps: 33703.06 (r/w/o: 33703.06/0.00/0.00) lat (ms,95%): 0.04 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 1 tps: 33632.95 qps: 33632.95 (r/w/o: 33632.95/0.00/0.00) lat (ms,95%): 0.04 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 1 tps: 33308.19 qps: 33308.19 (r/w/o: 33308.19/0.00/0.00) lat (ms,95%): 0.04 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 1 tps: 33627.92 qps: 33627.92 (r/w/o: 33627.92/0.00/0.00) lat (ms,95%): 0.04 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 1 tps: 33704.98 qps: 33704.98 (r/w/o: 33704.98/0.00/0.00) lat (ms,95%): 0.04 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 1 tps: 33683.05 qps: 33683.05 (r/w/o: 33683.05/0.00/0.00) lat (ms,95%): 0.04 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 1 tps: 33623.93 qps: 33623.93 (r/w/o: 33623.93/0.00/0.00) lat (ms,95%): 0.04 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 1 tps: 33625.28 qps: 33625.28 (r/w/o: 33625.28/0.00/0.00) lat (ms,95%): 0.04 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 1 tps: 33637.67 qps: 33637.67 (r/w/o: 33637.67/0.00/0.00) lat (ms,95%): 0.04 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 1 tps: 33704.05 qps: 33704.05 (r/w/o: 33704.05/0.00/0.00) lat (ms,95%): 0.04 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 1 tps: 34037.08 qps: 34037.08 (r/w/o: 34037.08/0.00/0.00) lat (ms,95%): 0.03 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 1 tps: 34372.86 qps: 34372.86 (r/w/o: 34372.86/0.00/0.00) lat (ms,95%): 0.03 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 1 tps: 34209.04 qps: 34209.04 (r/w/o: 34209.04/0.00/0.00) lat (ms,95%): 0.03 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 1 tps: 34341.01 qps: 34341.01 (r/w/o: 34341.01/0.00/0.00) lat (ms,95%): 0.03 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 1 tps: 34404.04 qps: 34404.04 (r/w/o: 34404.04/0.00/0.00) lat (ms,95%): 0.03 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 1 tps: 34402.97 qps: 34402.97 (r/w/o: 34402.97/0.00/0.00) lat (ms,95%): 0.03 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1007242
        write:                           0
        other:                           0
        total:                           1007242
    transactions:                        1007242 (33572.01 per sec.)
    queries:                             1007242 (33572.01 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.0014s
    total number of events:              1007242

Latency (ms):
         min:                                    0.03
         avg:                                    0.03
         max:                                    0.66
         95th percentile:                        0.03
         sum:                                29867.49

Threads fairness:
    events (avg/stddev):           1007242.0000/0.00
    execution time (avg/stddev):   29.8675/0.00